actuator/NS-DBD/sourceTriangle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     actuatorNSDBDRhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2e-05;

deltaT          1e-09;

writeControl    adjustableRunTime;

writeInterval   1.0e-7;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.4;

maxDeltaT       1.0e-8;

Period          1.0e-4;

HeatingTime     350.0e-9;

startHeating    0.0;

functions
{
    #includeFunc mag(U)
}

// ************************************************************************* //
